---
kind: method
id: M:Autodesk.Revit.DB.ConnectorSet.Erase(Autodesk.Revit.DB.Connector)
source: html/03c03f81-fe2c-aa3c-28a6-a07f1fb3588e.htm
---
# Autodesk.Revit.DB.ConnectorSet.Erase Method

## Syntax (C#)
```csharp
public virtual int Erase(
	Connector item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Connector`)